
export const subjectKoreanData = `
국어과 역량:

• 비판적·창의적 사고 역량
• 디지털·미디어 역량 (2015 개정 교육과정의 '자료·정보 활용 역량'이 변화된 언어 환경을 고려하여 수정됨)
• 의사소통 역량
• 공동체·대인 관계 역량
• 문화 향유 역량
• 자기 성찰·계발 역량

국어과 교육과정의 중점:
국어과의 6가지 역량은 비판적·창의적 이해와 표현, 협력적 의사소통과 공동체 문화, 언어생활에 대한 성찰과 개선, 문화 향유 등을 강조하며 각 과목의 성격 및 목표에 반영됩니다.

국어과 과목 구성:
국어과는 '공통 과목'과 '선택 과목'으로 나뉘며, 선택 과목은 다시 '일반 선택', '진로 선택', '융합 선택'으로 분류됩니다.

공통 과목: 기초 소양 및 기본 학력 함양, 학문의 기본 이해와 관련된 과목으로, 고교학점제 운영을 위해 '공통국어1'과 '공통국어2'로 나누어 설정되었습니다.

공통국어1, 공통국어2:
성격: 초등학교 및 중학교 '국어'의 성격을 계승하며, 국어 관련 학문의 기본적인 내용을 학습하고 고등학교 선택 과목의 심화 학습을 위한 토대를 마련하는 과목입니다. 듣기·말하기, 읽기, 쓰기, 문법, 문학, 매체로 구성되며, 미래 사회에 대비할 기본 역량을 함양하고 대학 진학 및 직업 활동에 필요한 국어 능력을 기르는 데 목적이 있습니다.
목표: 국어 의사소통의 맥락과 요소를 이해하고 협력적으로 참여하며 언어생활을 성찰하고 국어문화를 향유하여 미래 사회에 필요한 높은 수준의 국어 능력을 기르는 것입니다. 세부 목표로는 비판적·창의적 이해와 표현, 다양성 이해를 바탕으로 한 협력적 의사소통, 민주시민으로서의 문제 해결 참여, 공동체 언어문화 탐구 및 언어생활 개선, 국어문화 감상 및 향유 등이 있습니다.
내용 체계: 듣기·말하기, 읽기, 쓰기, 문법, 문학 영역으로 구성되며, 각 영역은 핵심 아이디어, 내용 요소(지식·이해, 과정·기능, 가치·태도)를 포함합니다.

선택 과목:

일반 선택:
• 화법과 언어: 공통 과목의 기본 내용을 토대로 화법과 언어의 하위 영역을 본격적으로 이해하고 탐구할 수 있도록 신설된 과목입니다.
• 독서와 작문: 초·중학교 '국어' 및 '공통국어1, 공통국어2'의 읽기·쓰기 영역을 심화·확장한 과목입니다. 다양한 글과 자료를 이해하고 생산하는 활동에 참여하여 효과적으로 의사소통하고 바람직한 의사소통 태도를 함양하는 데 목적이 있습니다. 독서와 작문이 문자 언어를 기반으로 하는 문어 의사소통 행위로서 인지적 문제 해결 및 사회문화적 소통 행위라는 공통점을 바탕으로 통합되었습니다. 또한, 복합양식적 특성을 고려하여 매체 자료 수용 및 생산에도 중점을 둡니다.
• 문학: 학습량을 고려하여 단독 과목으로 구성되었습니다.

진로 선택: 교과별 심화 학습 및 진로 관련 과목입니다.
• 주제 탐구 독서: 학습자의 진로와 연관 지어 국어과의 심화된 내용을 탐구하고 진로 활동에 필요한 실제적 역량을 기르도록 합니다. 문자 기반 외 디지털 기반의 언어 활동을 통해 정보와 지식을 창출하고, 사회 문제 해결을 도모합니다.
• 문학과 영상
• 직무 의사소통: 학습자의 직무 맥락과 연계된 과제를 통해 실제 직무에서 의사소통 능력을 신장하는 데 중점을 둡니다.

융합 선택: 창의적·융합적 역량 함양을 위해 국어과 내 여러 영역의 융합과 삶과의 관련성을 고려하여 설정되었습니다.
• 독서 토론과 글쓰기
• 매체 의사소통
• 언어생활 탐구: '공통국어1, 공통국어2'의 문법 영역을 중심으로 듣기·말하기, 쓰기, 매체 영역을 심화·확장한 과목입니다. 일상의 언어생활에서 다양한 주제를 탐구하여 비판적·창의적 사고력을 기르고 능동적인 언어 주체로서 바람직한 언어문화를 실천하도록 하는 데 목적이 있습니다. 언어가 자신을 성찰하고 타인과 소통하며 세상을 이해하는 핵심 자원이자 경로임을 인식하고, 다양한 삶의 맥락에서 효과적이고 적절한 언어 사용 방식을 모색하는 과정에서 언어생활에 대한 민감성을 고양하는 데 중점을 둡니다.

각 과목별 구성 체계:
국어과 선택 과목은 각 과목별로 '성격, 목표, 내용 체계, 성취기준, 교수·학습 및 평가'로 구성됩니다.
• 성격: 과목의 특성과 학습의 필요성을 설명합니다.
• 목표: 핵심 역량과의 연계성을 강조한 과목의 목표를 제시합니다.
• 내용 체계: '핵심 아이디어'를 명시하고 '지식·이해', '과정·기능', '가치·태도'의 세 범주와 그에 따른 '내용 요소'를 제시합니다.
• 성취기준: 내용 체계의 내용 요소를 유기적으로 결합하여 학습자의 목표 도달과 역량 함양을 위해 구성됩니다. '성취기준 해설'과 '성취기준 적용 시 고려 사항'이 포함됩니다.
• 교수·학습 및 평가: 과목별로 강조할 사항을 중심으로 교수·학습 및 평가의 방향과 방법을 제시합니다.
`;
