
export const subjectSocialData = `사회과 교육과정 설계의 개요:
사회과는 시민에게 필요한 자질을 갖추도록 설계되었으며, 총론에서 제시한 '포용성과 창의성을 갖춘 주도적인 사람'과 연계하여 다음과 같은 역량을 설정했습니다:

• 창의적 사고력
• 비판적 사고력
• 문제 해결력 및 의사 결정력
• 의사소통 및 협업 능력
• 정보 활용 능력

또한, 미래 변화에 대응하는 교육 방향으로 강조된 민주시민 및 생태전환 교육과 연계하여 사회과의 핵심 아이디어와 내용 요소에 공동체 의식, 평화, 인권, 문화 다양성 등의 민주시민 관련 내용과 기후위기 대응, 지속가능한 발전, 생태 감수성 등의 생태전환 교육 관련 내용을 반영하여 구성했습니다.

사회과 교육과정 체계:
사회과 교육과정은 '성격 및 목표', '내용 체계 및 성취기준', '교수학습 및 평가'로 구성됩니다.

성격 및 목표:
• 성격: 사회과 교육의 필요성과 역할에 초점을 맞추며, 주로 사회과가 추구하는 시민성과 내용 구성의 중점을 다루고, 이는 사회과의 목표와 연계됩니다.
• 목표: 교과 학습을 통해 기르고자 하는 능력과 학습의 도달점을 제시합니다.

내용 체계 및 성취기준:
• 내용 체계: 학습 내용의 범위와 수준을 나타냅니다. 영역별로 교과 역량을 함양하는 데 필요한 핵심 아이디어를 도출하고, 그에 기초하여 학생이 학습해야 할 내용 요소를 학년군별 및 학교급별로 제시합니다.
• 영역: 교과의 성격에 따라 기반 학문의 하위 영역이나 학습 내용을 구성하는 일차 조직자입니다.
• 핵심 아이디어: 영역을 아우르면서 해당 영역의 학습을 통해 일반화할 수 있는 내용을 핵심적으로 진술한 것으로, 깊이 있는 학습을 가능하게 하는 토대가 됩니다.
• 내용 요소: 교과에서 배워야 할 필수 학습 내용으로, '지식·이해', '과정·기능', '가치·태도'로 구성됩니다.
• 성취기준: 영역별 내용 요소를 학습한 결과 학생이 궁극적으로 할 수 있거나 하기를 기대하는 도달점을 의미하며, 대체로 지식·이해, 과정·기능, 가치·태도 중 두 가지 이상의 내용 요소를 정합하는 방식으로 진술됩니다. '성취기준 해설'과 '성취기준 적용 시 고려 사항'이 포함됩니다.

교수·학습 및 평가:
사회과 역량을 함양하기 위해 교사들이 교육과정을 설계하여 수업을 운영하고 평가하는 데 필요한 교과 수준의 교수·학습 및 평가 중점 사항에 초점을 두고 진술됩니다.

• 교수·학습의 방향: 교과의 목표 달성을 위한 원칙과 중점을 제시합니다.
• 교수·학습 방법: 방향에 따라 교과 수업에서 활용할 수 있는 방법이나 유의 사항을 제시합니다.
• 평가의 방향: 교과의 목표 달성 및 학습 지원을 위한 평가 원칙과 중점을 제시합니다.
• 평가 방법: 방향에 따라 교과의 평가에서 활용할 수 있는 방법이나 유의 사항을 제시합니다.

사회과 영역 구성:
사회과는 다음과 같은 영역을 중심으로 구성되었습니다:
• 지리 인식
• 자연환경과 인간생활
• 인문환경과 인간생활
• 지속가능한 세계
• 정치
• 법
• 경제
• 사회문화
• 역사 일반
• 지역사
• 한국사

이러한 영역들은 시공간 속의 인간과 사회 현상을 종합적으로 이해하고, 관련 문제나 쟁점을 창의적으로 해결하는 시민의 자질을 기르는 데 기여합니다.

사회과 과목 구성:
사회과는 공통 과목과 다양한 선택 과목으로 나뉩니다.

공통 과목:
• 한국사1, 한국사2
• 통합사회1, 통합사회2

선택 과목:
• 세계시민과 지리
• 세계사
• 사회와 문화
• 한국지리 탐구
• 도시의 미래 탐구
• 동아시아 역사 기행
• 정치
• 법과 사회
• 경제
• 국제 관계의 이해
• 여행지리
• 역사로 탐구하는 현대 세계
• 사회문제 탐구
• 금융과 경제생활
• 기후변화와 지속가능한 세계
`;